app/Http/Controllers/CarouselController.php

    public function index()
    {
        $carouselImages = Carousel::all();
---
select * from `carousels`

    public function indexAdmin()
    {
        $carousel = Carousel::paginate(4);
---
select * from `carousels` limit 4 offset 0
select count(*) as aggregate from `carousels`