app/Http/Controllers/CatalogController.php

    public function indexAdmin()
    {
        $catalogs = Catalog::paginate(10);
---
select * from `catalogs` limit 10 offset 0
select count(*) as aggregate from `catalogs`

    public function store(Request $request)
    {
        $validatedData = $request->validate([
            'name' => 'required',
            'description' => 'nullable',
            'price' => 'required|numeric',
            'category' => 'required',
            'image' => 'required|image|mimes:jpeg,png,jpg,gif,svg|max:2048',
        ]);

        try {
            $imagePath = $request->file('image');
            $imageName = date('Y-m-d&&') . $imagePath->getClientOriginalName();
            $path = 'image/catalog/' . $imageName;

            Storage::disk('public')->put($path, file_get_contents($imagePath));

            $validatedData['image'] = $imageName;
            Catalog::create($validatedData);
---
insert into `catalogs` (`name`, `description`, `price`, `category`, `image`, `updated_at`, `created_at`) values ('daaa', '<p>dasd</p>', '11111', 'shirt', '2024-01-15_16:19:24_hood.png', '2024-01-15 16:19:24', '2024-01-15 16:19:24')