app/Http/Controllers/DashboardController.php

select * from `catalogs` where `name` like '%%' or `category` like '%%'
select * from `news` where `title` like '%%' or `content` like '%%'
select * from `users` where `name` like '%%' or `email` like '%%'
---
    public function index(Request $request)
    {
        $searchKeyword = $request->input('search');

        // Pencarian pada tabel Catalog
        $catalogs = Catalog::query()
            ->where('name', 'like', '%' . $searchKeyword . '%')
            ->orWhere('category', 'like', '%' . $searchKeyword . '%')
            ->get();

        // Pencarian pada tabel News
        $news = News::query()
            ->where('title', 'like', '%' . $searchKeyword . '%')
            ->orWhere('content', 'like', '%' . $searchKeyword . '%')
            ->get();

        // Pencarian pada tabel User
        $users = User::query()
            ->where('name', 'like', '%' . $searchKeyword . '%')
            ->orWhere('email', 'like', '%' . $searchKeyword . '%')
            ->get();