app/Http/Controllers/NewsController.php

    public function indexAdmin()
    {
        $news = News::paginate(6);
---
select * from `news` limit 6 offset 0
select count(*) as aggregate from `news`