app/Http/Controllers/NewsController.php

    public function update(Request $request, $id)
    {
        $validatedData = $request->validate([
            'title' => 'required',
            'category' => 'required|in:' . implode(',', News::$categories),
            'content' => 'nullable',
            'image' => 'image|mimes:jpeg,png,jpg|max:10240',
        ]);

        $news = News::findOrFail($id);

        if ($request->hasFile('image')) {
            if (Storage::exists("image/news/{$news->image}")) {
                Storage::delete("image/news/{$news->image}");
            }

            $currentTime = Carbon::now();
            $formattedTime = $currentTime->format('Y-m-d_His');

            $imagePath = $request->file('image')->storeAs('image/news', $formattedTime . '_' . $request->file('image')->getClientOriginalName());
            $validatedData['image'] = basename($imagePath);

            $news->update($validatedData);

            return redirect()
                ->route('dashboard.news.index')
                ->with('success', 'Successfully updated news with changing image');
---
select * from `news` where `news`.`id` = '2' limit 1